slot system added
